package com.drozdova.app.data

import com.drozdova.app.domain.repository.DataRepo
import com.drozdova.app.presentation.model.FilialModel

class DataRepoImpl: DataRepo {
    override fun getDataList(): List<FilialModel> {
        return listOf(
            FilialModel("2.8400","2.8900","3.0900","3.1700",
                "2.7000","3.7200","0.9040","1.0940",
                "76.4000","0.0094","0.0086","83.1000",
                "пр.","Партизанский","8-49","Отделение 100\\/1050"),
            FilialModel("2.8400","2.8900","3.0900","3.1700",
                "2.7000","3.7200","0.9040","1.0940",
                "76.4000","0.0094","0.0086","83.1000",
                "пр.","Партизанский","8-49","Отделение 100\\/1050"),
            FilialModel("2.8400","2.8900","3.0900","3.1700",
                "2.7000","3.7200","0.9040","1.0940",
                "76.4000","0.0094","0.0086","83.1000",
                "пр.","Партизанский","8-49","Отделение 100\\/1050"),
            FilialModel("2.8400","2.8900","3.0900","3.1700",
                "2.7000","3.7200","0.9040","1.0940",
                "76.4000","0.0094","0.0086","83.1000",
                "пр.","Партизанский","8-49","Отделение 100\\/1050"),
            FilialModel("2.8400","2.8900","3.0900","3.1700",
                "2.7000","3.7200","0.9040","1.0940",
                "76.4000","0.0094","0.0086","83.1000",
                "пр.","Партизанский","8-49","Отделение 100\\/1050")
        )
    }
}